mag= float(input("Введіть магнітуду: "))

if 0<mag<2:
    print("Мікро: Мікроземлетруси, не відчуваються.")
if 2<=mag<3:
    print("Дуже слабкий: Як правило не відчуваються, але реєструються.")
if 3<=mag<4:
    print("Слабкий: Часто відчуваються, дуже рідко завдають шкоди.")
if 4<=mag<5:
    print("Легкий:Відчутне тремтіння речей всередині будинків, значна шкода малоймовірна.")
if 5<=mag<6:
    print("Помірний : Може завдати значної шкоди старим та погано сконструйованим будівлям на незначній території. Щонайбільше, незначні пошкодження добре спроектованим будівлям.")
if 6<=mag<7:
    print("Сильний : Може спричинити руйнацію на території до 150 км довжиною/шириною в населених регіонах.")
if 7<=mag<8:
    print("Дуже сильний :  Значна руйнація на значній території.")
if 8<=mag<9:
    print("Великий:Серйозна руйнація на територіях довжиною/шириною в сотні кілометрів.")
if mag>9:
    print("Рідкісно великий!!!")
else:
    print("Неверні дані!")
